ch32-riscv-ug/CH32V205/EVT/EXAM/IAP/USB_UART/CH32V205_APP/User/iap.c
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : iap.c
 * Author             : WCH
 * Version            : V1.0.2
 * Date               : 2026/03/27
 * Description        : IAP
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "iap.h"
#include "string.h"
#include "flash.h"
#include "core_riscv.h"
#include "usb_inf.h"
#include "ch32v205_flash.h"
/******************************************************************************/

iapfun jump2app;
vu32 Program_addr = FLASH_Base;
vu32 Verify_addr = FLASH_Base;
vu32 User_APP_Addr_offset = 0x6000;
vu8 Verify_Star_flag = 0;
vu8 Fast_Program_Buf[390];
u32 Program_Buf[64];
vu32 CodeLen = 0;
vu8 End_Flag = 0;
u8 IAP_Deal_Buf[USBD_DATA_SIZE+4];
#define  isp_cmd_t   ((isp_cmd  *)IAP_Deal_Buf)

#define  Size_256B         0x100
#define  Size_4KB          0x1000


/*********************************************************************
 * @fn      Program_Buf_Modify
 *
 * @brief   Program_Buf Modify
 *
 * @return  none
 */
void Program_Buf_Modify(void)
{
    for(int i = 0; i < 64; i++)
    {
        if(((CalAddr & 0xFFFFFF00)+4*i)!=CalAddr)
        {
            Program_Buf[i] = *(uint32_t*)((CalAddr & 0xFFFFFF00)+4*i);
        }
        else
        {
            Program_Buf[i] = (uint32_t)CheckNum;
        }
    }
}

/*********************************************************************
 * @fn      RecData_Deal
 *
 * @brief   USB deal data
 *
 * @return  ERR_ERROR - ERROR
 *          ERR_SUCCESS - SUCCESS
 *          ERR_End - End
 */
u8 RecData_Deal(void)
{
    u8 s;
    switch ( isp_cmd_t->other.buf[0]) 
    {
    case CMD_JUMP_IAP:
         Program_Buf_Modify();
         FLASH_ROM_ERASE(CalAddr & 0xFFFFFF00,Size_256B);
         CH32_IAP_Program(CalAddr & 0xFFFFFF00,(u32*)Program_Buf);
        s = ERR_SUCCESS;
        break;
    default:
        s = ERR_ERROR;
        break;
    }

    return s;
}

/*********************************************************************
 * @fn      UART_RecData_Deal
 *
 * @brief   UART deal data
 *
 * @return  ERR_ERROR - ERROR
 *          ERR_SUCCESS - SUCCESS
 *          ERR_End - End
 */
u8 UART_RecData_Deal(void)
{
    u8 s;
    switch ( isp_cmd_t->UART.Cmd) {
    case CMD_JUMP_IAP:
         Program_Buf_Modify();
         FLASH_ROM_ERASE(CalAddr & 0xFFFFFF00,Size_256B);
         CH32_IAP_Program(CalAddr & 0xFFFFFF00,(u32*)Program_Buf);
        s = ERR_SUCCESS;
        break;
    default:
        s = ERR_ERROR;
        break;
    }

    return s;
}

/*********************************************************************
 * @fn      GPIO_Cfg_init
 *
 * @brief   GPIO init
 *
 * @return  none
 */
void GPIO_Cfg_init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

/*********************************************************************
 * @fn      PA0_Check
 *
 * @brief   Check PA0 state
 *
 * @return  1 - IAP
 *          0 - APP
 */
u8 PA0_Check(void)
{
    u8 i, cnt=0;

    GPIO_Cfg_init();

    for(i=0; i<10; i++){
        if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==0) cnt++;
        Delay_Ms(5);
    }

    if(cnt>6) return 0;
    else return 1;
}

/*********************************************************************
 * @fn      USART2_CFG
 *
 * @brief   baudrate:UART2 baudrate
 *
 * @return  none
 */
void USART2_CFG(u32 baudrate)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    USART_InitTypeDef USART_InitStructure = {0};

    RCC_PB2PeriphClockCmd( RCC_PB2Periph_GPIOA, ENABLE);
    RCC_PB1PeriphClockCmd(RCC_PB1Periph_USART2,ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    USART_InitStructure.USART_BaudRate = baudrate;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl =
    USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;

    USART_Init(USART2, &USART_InitStructure);
    USART_Cmd(USART2, ENABLE);
}

/*********************************************************************
 * @fn      UART2_SendMultiyData
 *
 * @brief   Deal device Endpoint 3 OUT.
 *
 * @param   l: Data length.
 *
 * @return  none
 */
void UART2_SendMultiyData(u8* pbuf, u8 num)
{
    u8 i = 0;

    while(i<num)
    {
        while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
        USART_SendData(USART2, pbuf[i]);
        i++;
    }
}
/*********************************************************************
 * @fn      UART2_SendMultiyData
 *
 * @brief   USART2 send date
 *
 * @param   pbuf - Packet to be sent
 *          num - the number of date
 *
 * @return  none
 */
void UART2_SendData(u8 data)
{
    while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
    USART_SendData(USART2, data);
}

/*********************************************************************
 * @fn      Uart2_Rx
 *
 * @brief   Uart2 receive date
 *
 * @return  none
 */
u8 UART2_Rx(void)
{
    while( USART_GetFlagStatus(USART2, USART_FLAG_RXNE) == RESET);
    return USART_ReceiveData( USART2);
}

/*********************************************************************
 * @fn      UART_Rx_Deal
 *
 * @brief   UART Rx data deal
 *
 * @return  none
 */
void UART_Rx_Deal(void)
{
    u8 i, s;
    u16 Data_add = 0;

    if (UART2_Rx() == Uart_Sync_Head1)
    {
        if (UART2_Rx() == Uart_Sync_Head2)
        {
            isp_cmd_t->UART.Cmd = UART2_Rx();
            Data_add += isp_cmd_t->UART.Cmd;
            isp_cmd_t->UART.Len = UART2_Rx();
            Data_add += isp_cmd_t->UART.Len;

            if(isp_cmd_t->UART.Cmd == CMD_IAP_ERASE ||isp_cmd_t->UART.Cmd == CMD_IAP_VERIFY)
            {
                isp_cmd_t->other.buf[2] = UART2_Rx();
                Data_add += isp_cmd_t->other.buf[2];
                isp_cmd_t->other.buf[3] = UART2_Rx();
                Data_add += isp_cmd_t->other.buf[3];
                isp_cmd_t->other.buf[4] = UART2_Rx();
                Data_add += isp_cmd_t->other.buf[4];
                isp_cmd_t->other.buf[5] = UART2_Rx();
                Data_add += isp_cmd_t->other.buf[5];
            }
            if ((isp_cmd_t->other.buf[0] == CMD_IAP_PROM) || (isp_cmd_t->other.buf[0] == CMD_IAP_VERIFY))
            {
                for (i = 0; i < isp_cmd_t->UART.Len; i++) {
                    isp_cmd_t->UART.data[i] = UART2_Rx();
                    Data_add += isp_cmd_t->UART.data[i];
                }
            }
            if (UART2_Rx() == (uint8_t)(Data_add & 0xFF))
            {
                if(UART2_Rx() == (uint8_t)(Data_add >>8))
                {
                    if (UART2_Rx() == Uart_Sync_Head2)
                    {
                        if (UART2_Rx() == Uart_Sync_Head1)
                        {
                            s = UART_RecData_Deal();

                            if (s != ERR_End)
                            {
                                UART2_SendData(Uart_Sync_Head1);
                                UART2_SendData(Uart_Sync_Head2);
                                UART2_SendData(0x00);
                                if (s == ERR_ERROR)
                                {
                                    UART2_SendData(0x01);
                                }
                                else
                                {
                                    UART2_SendData(0x00);
                                }
                                UART2_SendData(Uart_Sync_Head2);
                                UART2_SendData(Uart_Sync_Head1);
                            }
                        }
                    }
                }
            }
        }
    }
}
